-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3307
-- Generation Time: Jun 24, 2023 at 07:11 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `phongtro_danang`
--

-- --------------------------------------------------------

--
-- Table structure for table `baiviet`
--

CREATE TABLE `baiviet` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `menu_id` int(11) NOT NULL DEFAULT 0,
  `ten` varchar(255) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `mota` varchar(255) DEFAULT NULL,
  `anhdaidien` varchar(255) DEFAULT NULL,
  `noidung` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `danhmuc`
--

CREATE TABLE `danhmuc` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ten` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `tieude` varchar(255) DEFAULT NULL,
  `mota` varchar(255) DEFAULT NULL,
  `trangthai` tinyint(4) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `danhmuc`
--

INSERT INTO `danhmuc` (`id`, `ten`, `slug`, `tieude`, `mota`, `trangthai`, `created_at`, `updated_at`) VALUES
(21, 'Cho thuê phòng trọ', 'cho-thue-phong-tro', NULL, 'Cho thuê phòng trọ', 1, '2023-05-31 14:30:17', '2023-06-09 04:06:42'),
(22, 'Nhà cho thuê', 'nha-cho-thue', NULL, 'Nhà cho thuê', 1, '2023-05-31 14:30:48', '2023-06-09 04:06:38'),
(23, 'Cho thuê mặt bằng', 'cho-thue-mat-bang', NULL, 'Cho thuê mặt bằng', 1, '2023-05-31 14:33:12', '2023-06-09 04:06:35'),
(24, 'Ở ghép', 'o-ghep', NULL, 'Ở ghép', 1, '2023-05-31 15:21:38', '2023-06-11 01:05:10');

-- --------------------------------------------------------

--
-- Table structure for table `diachi`
--

CREATE TABLE `diachi` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ten` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `tieude` varchar(255) DEFAULT NULL,
  `mota` varchar(255) DEFAULT NULL,
  `anhdaidien` varchar(255) DEFAULT NULL,
  `trangthai` tinyint(4) NOT NULL DEFAULT 1,
  `hot` tinyint(4) NOT NULL DEFAULT 0,
  `parent_id` bigint(20) NOT NULL DEFAULT 0,
  `loai` tinyint(4) NOT NULL DEFAULT 1 COMMENT '1 là quận huyện, 2 là phường xã',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `diachi`
--

INSERT INTO `diachi` (`id`, `ten`, `slug`, `tieude`, `mota`, `anhdaidien`, `trangthai`, `hot`, `parent_id`, `loai`, `created_at`, `updated_at`) VALUES
(44, 'Hải Châu', 'hai-chau', NULL, NULL, '2023-04-27__hanh-chinh.jpg', 1, 1, 0, 1, '2023-04-26 07:09:08', '2023-06-08 17:44:13'),
(45, 'Thanh Bình', 'thanh-binh', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 07:09:17', '2023-04-26 07:09:17'),
(46, 'Thuận Phước', 'thuan-phuoc', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 07:09:44', '2023-04-26 07:09:44'),
(47, 'Phước Ninh', 'phuoc-ninh', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 07:10:00', '2023-04-26 07:10:00'),
(48, 'Sơn Trà', 'son-tra', NULL, NULL, '2023-04-27__tour-ban-dao-son-tra.png', 1, 1, 0, 1, '2023-04-26 07:14:38', '2023-04-27 13:52:14'),
(49, 'Nại Hiên Đông', 'nai-hien-dong', NULL, NULL, NULL, 1, 0, 48, 2, '2023-04-26 07:14:53', '2023-04-26 07:14:53'),
(50, 'Mân Thái', 'man-thai', NULL, NULL, NULL, 1, 0, 48, 2, '2023-04-26 07:15:10', '2023-04-26 07:15:10'),
(51, 'An Hải Bắc', 'an-hai-bac', NULL, NULL, NULL, 1, 0, 48, 2, '2023-04-26 07:15:25', '2023-04-26 07:15:25'),
(52, 'Hòa Vang', 'hoa-vang', NULL, NULL, '2023-04-27__hoa-vang.jpg', 1, 0, 0, 1, '2023-04-26 09:54:03', '2023-06-11 01:09:53'),
(53, 'Hòa Bắc', 'hoa-bac', NULL, NULL, NULL, 1, 0, 52, 2, '2023-04-26 09:54:17', '2023-04-26 23:35:08'),
(55, 'Ngũ Hành Sơn', 'ngu-hanh-son', NULL, NULL, '2023-04-27__ngu-hanh-son.jpg', 1, 1, 0, 1, '2023-04-26 11:29:42', '2023-04-27 13:51:54'),
(56, 'Hoà Quý', 'hoa-quy', NULL, NULL, NULL, 1, 0, 55, 2, '2023-04-26 11:30:34', '2023-04-26 23:35:15'),
(57, 'Liên Chiểu', 'lien-chieu', NULL, NULL, NULL, 1, 0, 0, 1, '2023-04-26 23:48:23', '2023-04-26 23:48:23'),
(58, 'Thanh Khê', 'thanh-khe', NULL, NULL, NULL, 1, 0, 0, 1, '2023-04-26 23:48:33', '2023-04-26 23:48:33'),
(59, 'Cẩm Lệ', 'cam-le', NULL, NULL, NULL, 1, 0, 0, 1, '2023-04-26 23:48:45', '2023-04-26 23:48:45'),
(60, 'Hoàng Sa', 'hoang-sa', NULL, NULL, NULL, 1, 1, 0, 1, '2023-04-26 23:48:57', '2023-06-08 17:46:26'),
(61, 'Hòa Hiệp Bắc', 'hoa-hiep-bac', NULL, NULL, NULL, 1, 0, 57, 2, '2023-04-26 23:49:40', '2023-04-26 23:49:40'),
(62, 'Hòa Hiệp Nam', 'hoa-hiep-nam', NULL, NULL, NULL, 1, 0, 57, 2, '2023-04-26 23:49:51', '2023-04-26 23:49:51'),
(63, 'Hòa Khánh Bắc', 'hoa-khanh-bac', NULL, NULL, NULL, 1, 0, 57, 2, '2023-04-26 23:50:04', '2023-04-26 23:50:04'),
(64, 'Hòa Khánh Nam', 'hoa-khanh-nam', NULL, NULL, NULL, 1, 0, 57, 2, '2023-04-26 23:50:14', '2023-04-27 13:51:26'),
(65, 'Hòa Minh', 'hoa-minh', NULL, NULL, NULL, 1, 0, 57, 2, '2023-04-26 23:50:24', '2023-04-26 23:50:24'),
(66, 'Tam Thuận', 'tam-thuan', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:50:34', '2023-04-26 23:50:34'),
(67, 'Thanh Khê Tây', 'thanh-khe-tay', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:50:46', '2023-04-26 23:50:46'),
(68, 'Thanh Khê Đông', 'thanh-khe-dong', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:50:59', '2023-04-26 23:50:59'),
(69, 'Xuân Hà', 'xuan-ha', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:51:12', '2023-04-26 23:51:12'),
(70, 'Tân Chính', 'tan-chinh', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:51:22', '2023-04-26 23:51:22'),
(71, 'Chính Gián', 'chinh-gian', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:51:33', '2023-04-26 23:51:33'),
(72, 'Vĩnh Trung', 'vinh-trung', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:51:44', '2023-04-26 23:51:44'),
(73, 'Thạc Gián', 'thac-gian', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:51:54', '2023-04-26 23:51:55'),
(74, 'An Khê', 'an-khe', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:52:07', '2023-04-26 23:52:07'),
(75, 'Hòa Khê', 'hoa-khe', NULL, NULL, NULL, 1, 0, 58, 2, '2023-04-26 23:52:19', '2023-04-26 23:52:19'),
(76, 'Thạch Thang', 'thach-thang', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:52:34', '2023-04-26 23:52:34'),
(77, 'Hải Châu I', 'hai-chau-i', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:52:42', '2023-04-26 23:52:42'),
(78, 'Hải Châu II', 'hai-chau-ii', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:52:52', '2023-04-26 23:52:52'),
(80, 'Hòa Thuận Tây', 'hoa-thuan-tay', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:10', '2023-04-26 23:53:10'),
(81, 'Hòa Thuận Đông', 'hoa-thuan-dong', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:18', '2023-04-26 23:53:18'),
(82, 'Nam Dương', 'nam-duong', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:27', '2023-04-26 23:53:27'),
(83, 'Bình Hiên', 'binh-hien', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:38', '2023-04-26 23:53:38'),
(84, 'Bình Thuận', 'binh-thuan', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:45', '2023-04-26 23:53:45'),
(85, 'Hòa Cường Bắc', 'hoa-cuong-bac', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:53:54', '2023-04-26 23:53:54'),
(86, 'Hòa Cường Nam', 'hoa-cuong-nam', NULL, NULL, NULL, 1, 0, 44, 2, '2023-04-26 23:54:04', '2023-04-26 23:54:04');

-- --------------------------------------------------------

--
-- Table structure for table `hinhanh_ct`
--

CREATE TABLE `hinhanh_ct` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ten` varchar(255) DEFAULT NULL,
  `duongdan` varchar(255) DEFAULT NULL,
  `phong_id` bigint(20) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `hinhanh_ct`
--

INSERT INTO `hinhanh_ct` (`id`, `ten`, `duongdan`, `phong_id`, `created_at`, `updated_at`) VALUES
(1, 'book-store.jpg', '2023-04-09__book-storejpg.jpg', 15, '2023-04-09 12:14:36', NULL),
(2, 'book-store.jpg', '2023-04-11__book-storejpg.jpg', 16, '2023-04-11 04:32:55', NULL),
(3, 'book-store.jpg', '2023-04-11__book-storejpg.jpg', 17, '2023-04-11 04:34:41', NULL),
(4, '1563780097.jpg', '2023-04-17__1563780097jpg.jpg', 19, '2023-04-17 16:37:27', NULL),
(5, '20221212220027-8cf0_wm.jpg', '2023-04-17__20221212220027-8cf0-wmjpg.jpg', 19, '2023-04-17 16:37:27', NULL),
(6, 'cho-thue-phong-tro_1628953361.jpg', '2023-04-17__cho-thue-phong-tro-1628953361jpg.jpg', 19, '2023-04-17 16:37:27', NULL),
(7, 'ffffffffff.png', '2023-04-17__ffffffffffpng.png', 19, '2023-04-17 16:37:27', NULL),
(8, 'nha-tro-quan-8-3.jpg', '2023-04-17__nha-tro-quan-8-3jpg.jpg', 19, '2023-04-17 16:37:27', NULL),
(9, '1563780097.jpg', '2023-04-17__1563780097jpg.jpg', 20, '2023-04-17 16:41:54', NULL),
(10, '20221212220027-8cf0_wm.jpg', '2023-04-17__20221212220027-8cf0-wmjpg.jpg', 20, '2023-04-17 16:41:54', NULL),
(11, 'cho-thue-phong-tro_1628953361.jpg', '2023-04-17__cho-thue-phong-tro-1628953361jpg.jpg', 20, '2023-04-17 16:41:54', NULL),
(12, 'ffffffffff.png', '2023-04-17__ffffffffffpng.png', 20, '2023-04-17 16:41:54', NULL),
(13, 'nha-tro-quan-8-3.jpg', '2023-04-17__nha-tro-quan-8-3jpg.jpg', 20, '2023-04-17 16:41:54', NULL),
(14, '1898_1608201775.jpg', '2023-04-25__1898-1608201775jpg.jpg', 24, '2023-04-25 02:56:21', NULL),
(15, '1563780097.jpg', '2023-04-25__1563780097jpg.jpg', 24, '2023-04-25 02:56:21', NULL),
(16, '20221212220027-8cf0_wm.jpg', '2023-04-25__20221212220027-8cf0-wmjpg.jpg', 24, '2023-04-25 02:56:21', NULL),
(17, 'cho-thue-phong-tro_1628953361.jpg', '2023-04-25__cho-thue-phong-tro-1628953361jpg.jpg', 24, '2023-04-25 02:56:21', NULL),
(18, 'ffffffffff.png', '2023-04-25__ffffffffffpng.png', 24, '2023-04-25 02:56:21', NULL),
(19, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-04-25__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 25, '2023-04-25 03:01:11', NULL),
(20, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-04-25__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 25, '2023-04-25 03:01:11', NULL),
(21, 'beauty-1621999245839_1622780852.jpg', '2023-04-25__beauty-1621999245839-1622780852jpg.jpg', 25, '2023-04-25 03:01:11', NULL),
(22, 'f61dddf767bdca04bebe46258154153f-2788229389940538330.jpg', '2023-04-25__f61dddf767bdca04bebe46258154153f-2788229389940538330jpg.jpg', 25, '2023-04-25 03:01:11', NULL),
(23, '20221212220027-8cf0_wm.jpg', '2023-04-26__20221212220027-8cf0-wmjpg.jpg', 28, '2023-04-26 01:28:15', NULL),
(24, '20221212220027-8cf0_wm.jpg', '2023-04-26__20221212220027-8cf0-wmjpg.jpg', 29, '2023-04-26 01:30:10', NULL),
(25, '1898_1608201775.jpg', '2023-04-26__1898-1608201775jpg.jpg', 31, '2023-04-26 07:18:33', NULL),
(26, '1563780097.jpg', '2023-04-26__1563780097jpg.jpg', 31, '2023-04-26 07:18:33', NULL),
(27, '20221212220027-8cf0_wm.jpg', '2023-04-26__20221212220027-8cf0-wmjpg.jpg', 31, '2023-04-26 07:18:33', NULL),
(28, 'cho-thue-phong-tro_1628953361.jpg', '2023-04-26__cho-thue-phong-tro-1628953361jpg.jpg', 31, '2023-04-26 07:18:33', NULL),
(29, 'ffffffffff.png', '2023-04-26__ffffffffffpng.png', 31, '2023-04-26 07:18:33', NULL),
(30, '20221212220027-8cf0_wm.jpg', '2023-04-26__20221212220027-8cf0-wmjpg.jpg', 32, '2023-04-26 07:21:16', NULL),
(31, 'beauty-1621999245839_1622780852.jpg', '2023-04-26__beauty-1621999245839-1622780852jpg.jpg', 32, '2023-04-26 07:21:16', NULL),
(32, 'cho-thue-phong-tro_1628953361.jpg', '2023-04-26__cho-thue-phong-tro-1628953361jpg.jpg', 32, '2023-04-26 07:21:16', NULL),
(33, 'f61dddf767bdca04bebe46258154153f-2788229389940538330.jpg', '2023-04-26__f61dddf767bdca04bebe46258154153f-2788229389940538330jpg.jpg', 32, '2023-04-26 07:21:16', NULL),
(34, '20230415110145-f81b_wm.jpg', '2023-04-27__20230415110145-f81b-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(35, '20230415110202-026f_wm.jpg', '2023-04-27__20230415110202-026f-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(36, '20230415110208-7bca_wm.jpg', '2023-04-27__20230415110208-7bca-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(37, '20230415110214-b335_wm.jpg', '2023-04-27__20230415110214-b335-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(38, '20230415110220-2ff7_wm.jpg', '2023-04-27__20230415110220-2ff7-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(39, '20230415110225-fc4a_wm.jpg', '2023-04-27__20230415110225-fc4a-wmjpg.jpg', 35, '2023-04-27 01:10:42', NULL),
(40, 'img-20230329-083755_1680347492.jpg', '2023-04-27__img-20230329-083755-1680347492jpg.jpg', 36, '2023-04-27 01:15:30', NULL),
(41, 'img-20230329-083802_1680347488.jpg', '2023-04-27__img-20230329-083802-1680347488jpg.jpg', 36, '2023-04-27 01:15:30', NULL),
(42, 'img-20230401-081233_1680347481.jpg', '2023-04-27__img-20230401-081233-1680347481jpg.jpg', 36, '2023-04-27 01:15:30', NULL),
(43, 'img-20230401-084127_1680347480.jpg', '2023-04-27__img-20230401-084127-1680347480jpg.jpg', 36, '2023-04-27 01:15:30', NULL),
(44, 'b68ba474-d6d9-48a9-8c34-2fd1f2d86caa_1682075154.jpg', '2023-04-27__b68ba474-d6d9-48a9-8c34-2fd1f2d86caa-1682075154jpg.jpg', 37, '2023-04-27 01:35:37', NULL),
(45, 'img-20230329-083748_1680347497.jpg', '2023-04-27__img-20230329-083748-1680347497jpg.jpg', 37, '2023-04-27 01:35:37', NULL),
(46, 'img-20230329-083755_1680347492.jpg', '2023-04-27__img-20230329-083755-1680347492jpg.jpg', 37, '2023-04-27 01:35:37', NULL),
(47, 'img-20230329-083802_1680347488.jpg', '2023-04-27__img-20230329-083802-1680347488jpg.jpg', 37, '2023-04-27 01:35:37', NULL),
(48, 'img-20230401-084127_1680347480.jpg', '2023-04-27__img-20230401-084127-1680347480jpg.jpg', 37, '2023-04-27 01:35:37', NULL),
(49, '82074507-2726551164131114-1337480956600123392-o_1582339031 (1).jpg', '2023-04-27__82074507-2726551164131114-1337480956600123392-o-1582339031-1jpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(50, '20230415110214-b335_wm.jpg', '2023-04-27__20230415110214-b335-wmjpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(51, '20230415110225-fc4a_wm.jpg', '2023-04-27__20230415110225-fc4a-wmjpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(52, 'img-20230329-083748_1680347497.jpg', '2023-04-27__img-20230329-083748-1680347497jpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(53, 'img-20230329-083755_1680347492.jpg', '2023-04-27__img-20230329-083755-1680347492jpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(54, 'img-20230329-083802_1680347488.jpg', '2023-04-27__img-20230329-083802-1680347488jpg.jpg', 38, '2023-04-27 01:43:41', NULL),
(55, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-04-29__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 39, '2023-04-29 15:08:20', NULL),
(56, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-05-30__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 41, '2023-05-30 05:53:05', NULL),
(57, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-05-30__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 41, '2023-05-30 05:53:05', NULL),
(58, '1898_1608201775.jpg', '2023-05-30__1898-1608201775jpg.jpg', 41, '2023-05-30 05:53:05', NULL),
(59, '1563780097.jpg', '2023-05-30__1563780097jpg.jpg', 41, '2023-05-30 05:53:05', NULL),
(60, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-05-30__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 42, '2023-05-30 05:54:31', NULL),
(61, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-05-30__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 42, '2023-05-30 05:54:31', NULL),
(62, '1898_1608201775.jpg', '2023-05-30__1898-1608201775jpg.jpg', 42, '2023-05-30 05:54:31', NULL),
(63, '1563780097.jpg', '2023-05-30__1563780097jpg.jpg', 42, '2023-05-30 05:54:31', NULL),
(64, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-05-30__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 43, '2023-05-30 05:56:49', NULL),
(65, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-05-30__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 43, '2023-05-30 05:56:49', NULL),
(66, '1898_1608201775.jpg', '2023-05-30__1898-1608201775jpg.jpg', 43, '2023-05-30 05:56:49', NULL),
(67, '1563780097.jpg', '2023-05-30__1563780097jpg.jpg', 43, '2023-05-30 05:56:49', NULL),
(68, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-05-30__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 45, '2023-05-30 06:47:39', NULL),
(69, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-05-30__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 45, '2023-05-30 06:47:39', NULL),
(70, '1563780097.jpg', '2023-05-30__1563780097jpg.jpg', 45, '2023-05-30 06:47:39', NULL),
(71, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-05-30__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 46, '2023-05-30 06:49:24', NULL),
(72, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-05-30__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 46, '2023-05-30 06:49:24', NULL),
(73, '1563780097.jpg', '2023-05-30__1563780097jpg.jpg', 46, '2023-05-30 06:49:24', NULL),
(74, 'b68ba474-d6d9-48a9-8c34-2fd1f2d86caa_1682075154.jpg', '2023-06-02__b68ba474-d6d9-48a9-8c34-2fd1f2d86caa-1682075154jpg.jpg', 50, '2023-06-02 03:02:26', NULL),
(75, 'img-20230329-083755_1680347492.jpg', '2023-06-02__img-20230329-083755-1680347492jpg.jpg', 50, '2023-06-02 03:02:26', NULL),
(76, '20230526185337-0713_wm.jpg', '2023-06-02__20230526185337-0713-wmjpg.jpg', 52, '2023-06-02 03:33:15', NULL),
(77, '20230528145744-b87f_wm.jpg', '2023-06-02__20230528145744-b87f-wmjpg.jpg', 52, '2023-06-02 03:33:15', NULL),
(78, '20230528145753-341b_wm.jpg', '2023-06-02__20230528145753-341b-wmjpg.jpg', 52, '2023-06-02 03:33:15', NULL),
(79, '20230528145802-b870_wm.jpg', '2023-06-02__20230528145802-b870-wmjpg.jpg', 52, '2023-06-02 03:33:15', NULL),
(80, '20220209015234-e9fd_wm.jpg', '2023-06-02__20220209015234-e9fd-wmjpg.jpg', 53, '2023-06-02 03:35:10', NULL),
(81, '20230323123637-0a93_wm.jpeg', '2023-06-02__20230323123637-0a93-wmjpeg.jpeg', 53, '2023-06-02 03:35:10', NULL),
(82, '20230323123637-0761_wm.jpeg', '2023-06-02__20230323123637-0761-wmjpeg.jpeg', 53, '2023-06-02 03:35:10', NULL),
(83, '20230323123641-f3aa_wm.jpeg', '2023-06-02__20230323123641-f3aa-wmjpeg.jpeg', 53, '2023-06-02 03:35:10', NULL),
(84, '143112108-1207924362942958-734586911169325420-n_1611738666.jpg', '2023-06-02__143112108-1207924362942958-734586911169325420-n-1611738666jpg.jpg', 54, '2023-06-02 05:13:50', NULL),
(85, 'received-478551717420080_1661667922.jpg', '2023-06-02__received-478551717420080-1661667922jpg.jpg', 54, '2023-06-02 05:13:50', NULL),
(86, 'received-803263340848942_1661667847.jpg', '2023-06-02__received-803263340848942-1661667847jpg.jpg', 54, '2023-06-02 05:13:50', NULL),
(87, 'received-1426186704569733_1661667846.jpg', '2023-06-02__received-1426186704569733-1661667846jpg.jpg', 54, '2023-06-02 05:13:50', NULL),
(88, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-06-02__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 55, '2023-06-02 05:18:31', NULL),
(89, '20221212220027-8cf0_wm.jpg', '2023-06-02__20221212220027-8cf0-wmjpg.jpg', 55, '2023-06-02 05:18:31', NULL),
(90, 'z4080112962527-71ee9462728f19809706bc9df96342c9_1675398988.jpg', '2023-06-02__z4080112962527-71ee9462728f19809706bc9df96342c9-1675398988jpg.jpg', 56, '2023-06-02 05:25:52', NULL),
(91, 'z4080112972610-463015b628e38e85121c36884e547d23_1675398984.jpg', '2023-06-02__z4080112972610-463015b628e38e85121c36884e547d23-1675398984jpg.jpg', 56, '2023-06-02 05:25:52', NULL),
(92, 'z4080112972611-2e673d4f1b96e902aa6a2ce9eb3dbc00_1675398980.jpg', '2023-06-02__z4080112972611-2e673d4f1b96e902aa6a2ce9eb3dbc00-1675398980jpg.jpg', 56, '2023-06-02 05:25:52', NULL),
(93, 'z4080112977310-cddf81205348478650f6af8c3035229a_1675398970.jpg', '2023-06-02__z4080112977310-cddf81205348478650f6af8c3035229a-1675398970jpg.jpg', 56, '2023-06-02 05:25:52', NULL),
(94, 'z3461685399918-fb8f23f5fa33398a9fc69d908c5e05f8_1657081289.jpg', '2023-06-02__z3461685399918-fb8f23f5fa33398a9fc69d908c5e05f8-1657081289jpg.jpg', 57, '2023-06-02 05:32:59', NULL),
(95, 'z3461685406599-e81dba8f6a2fd19cba1e5b5c8daaa263_1657081302.jpg', '2023-06-02__z3461685406599-e81dba8f6a2fd19cba1e5b5c8daaa263-1657081302jpg.jpg', 57, '2023-06-02 05:32:59', NULL),
(96, 'z3461685412087-78a03430f36eea2b47dacda258e317b4_1657081293.jpg', '2023-06-02__z3461685412087-78a03430f36eea2b47dacda258e317b4-1657081293jpg.jpg', 57, '2023-06-02 05:32:59', NULL),
(97, 'z3461685438194-95eba19dbdb67333d39411189b60bae1_1657081311.jpg', '2023-06-02__z3461685438194-95eba19dbdb67333d39411189b60bae1-1657081311jpg.jpg', 57, '2023-06-02 05:32:59', NULL),
(98, '55ce8423-f8ec-4598-aa2b-6985818132bc_1667018264.jpg', '2023-06-02__55ce8423-f8ec-4598-aa2b-6985818132bc-1667018264jpg.jpg', 58, '2023-06-02 05:35:22', NULL),
(99, '5c661bc9c9b60c43088f896f108e37e3-2788229389710024465.jpg', '2023-06-08__5c661bc9c9b60c43088f896f108e37e3-2788229389710024465jpg.jpg', 59, '2023-06-08 11:08:09', NULL),
(100, '46cce2cf4363227d7abe706547c961e7-2788229389905549011.jpg', '2023-06-08__46cce2cf4363227d7abe706547c961e7-2788229389905549011jpg.jpg', 59, '2023-06-08 11:08:09', NULL),
(101, '1563780097.jpg', '2023-06-08__1563780097jpg.jpg', 59, '2023-06-08 11:08:09', NULL),
(102, '20221212220027-8cf0_wm.jpg', '2023-06-08__20221212220027-8cf0-wmjpg.jpg', 59, '2023-06-08 11:08:09', NULL),
(103, '1898_1608201775.jpg', '2023-06-08__1898-1608201775jpg.jpg', 63, '2023-06-08 15:11:46', NULL),
(104, '100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13.jpg', '2023-06-09__100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13jpg.jpg', 67, '2023-06-09 03:14:13', NULL),
(105, '1 (2).jpg', '2023-06-10__1-2jpg.jpg', 78, '2023-06-10 15:46:32', NULL),
(106, '1.jpg', '2023-06-10__1jpg.jpg', 78, '2023-06-10 15:46:32', NULL),
(107, '100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13.jpg', '2023-06-10__100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13jpg.jpg', 78, '2023-06-10 15:46:32', NULL),
(108, '1 (2).jpg', '2023-06-10__1-2jpg.jpg', 79, '2023-06-10 15:48:34', NULL),
(109, '1.jpg', '2023-06-10__1jpg.jpg', 79, '2023-06-10 15:48:34', NULL),
(110, '100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13.jpg', '2023-06-10__100-hinh-nen-anh-da-nang-dep-nhat-full-hd-cho-may-tinh-dien-thoai-13jpg.jpg', 79, '2023-06-10 15:48:34', NULL),
(111, '1 (2).jpg', '2023-06-10__1-2jpg.jpg', 80, '2023-06-10 16:02:34', NULL),
(112, '1.jpg', '2023-06-10__1jpg.jpg', 80, '2023-06-10 16:02:34', NULL),
(113, '1563780097.jpg', '2023-06-11__1563780097jpg.jpg', 81, '2023-06-10 18:37:57', NULL),
(114, '20221212220027-8cf0_wm.jpg', '2023-06-11__20221212220027-8cf0-wmjpg.jpg', 81, '2023-06-10 18:37:57', NULL),
(115, '1563780097.jpg', '2023-06-11__1563780097jpg.jpg', 84, '2023-06-10 18:47:50', NULL),
(116, 'thiet-ke-phong-tro-khep-kin-1.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-1jpg.jpg', 85, '2023-06-10 19:49:00', NULL),
(117, 'thiet-ke-phong-tro-khep-kin-8.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-8jpg.jpg', 85, '2023-06-10 19:49:00', NULL),
(118, 'thiet-ke-phong-tro-khep-kin-10.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-10jpg.jpg', 85, '2023-06-10 19:49:00', NULL),
(119, 'thiet-ke-phong-tro-khep-kin-15m2-dep.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-15m2-depjpg.jpg', 87, '2023-06-11 00:25:05', NULL),
(120, 'thiet-ke-phong-tro-khep-kin-18m2.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-18m2jpg.jpg', 87, '2023-06-11 00:25:05', NULL),
(121, 'thiet-ke-phong-tro-khep-kin-nho-dep.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-nho-depjpg.jpg', 87, '2023-06-11 00:25:05', NULL),
(122, 'thiet-ke-phong-tro-khep-kin-11.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-11jpg.jpg', 88, '2023-06-11 00:28:46', NULL),
(123, 'thiet-ke-phong-tro-khep-kin-15m2-dep.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-15m2-depjpg.jpg', 88, '2023-06-11 00:28:46', NULL),
(124, 'thiet-ke-phong-tro-khep-kin-18m2.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-18m2jpg.jpg', 88, '2023-06-11 00:28:46', NULL),
(125, '20221212220027-8cf0_wm.jpg', '2023-06-11__20221212220027-8cf0-wmjpg.jpg', 89, '2023-06-11 00:34:12', NULL),
(126, 'thiet-ke-phong-tro-dep-55.jpg', '2023-06-11__thiet-ke-phong-tro-dep-55jpg.jpg', 89, '2023-06-11 00:34:12', NULL),
(127, 'thiet-ke-phong-tro-khep-kin-co-gac-lung-dep.jpg', '2023-06-11__thiet-ke-phong-tro-khep-kin-co-gac-lung-depjpg.jpg', 89, '2023-06-11 00:34:12', NULL),
(128, 'thiet-ke-phong-tro-dep-31.jpg', '2023-06-11__thiet-ke-phong-tro-dep-31jpg.jpg', 90, '2023-06-11 00:47:48', NULL),
(129, 'thiet-ke-phong-tro-dep-58.jpg', '2023-06-11__thiet-ke-phong-tro-dep-58jpg.jpg', 90, '2023-06-11 00:47:48', NULL),
(130, 'thiet-ke-phong-tro-dep-60.jpg', '2023-06-11__thiet-ke-phong-tro-dep-60jpg.jpg', 90, '2023-06-11 00:47:48', NULL),
(131, 'thiet-ke-phong-tro-dep-4.jpg', '2023-06-11__thiet-ke-phong-tro-dep-4jpg.jpg', 91, '2023-06-11 00:59:40', NULL),
(132, 'thiet-ke-phong-tro-dep-56.jpg', '2023-06-11__thiet-ke-phong-tro-dep-56jpg.jpg', 91, '2023-06-11 00:59:40', NULL),
(133, 'thiet-ke-phong-tro-dep-58.jpg', '2023-06-11__thiet-ke-phong-tro-dep-58jpg.jpg', 91, '2023-06-11 00:59:40', NULL),
(134, 'thiet-ke-phong-tro-dep-41.jpg', '2023-06-11__thiet-ke-phong-tro-dep-41jpg.jpg', 92, '2023-06-11 09:25:39', NULL),
(135, 'thiet-ke-phong-tro-dep-45.jpg', '2023-06-11__thiet-ke-phong-tro-dep-45jpg.jpg', 92, '2023-06-11 09:25:39', NULL),
(136, 'thiet-ke-phong-tro-dep-47.jpg', '2023-06-11__thiet-ke-phong-tro-dep-47jpg.jpg', 92, '2023-06-11 09:25:39', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `lichsu_naptien`
--

CREATE TABLE `lichsu_naptien` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ma` varchar(100) NOT NULL,
  `nguoidung_id` bigint(20) NOT NULL DEFAULT 0,
  `loai` tinyint(4) NOT NULL COMMENT 'phương thức',
  `tien` int(11) NOT NULL DEFAULT 0,
  `giamgia` int(11) NOT NULL DEFAULT 0,
  `tongtien` int(11) NOT NULL DEFAULT 0,
  `trangthai` tinyint(4) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `lichsu_naptien`
--

INSERT INTO `lichsu_naptien` (`id`, `ma`, `nguoidung_id`, `loai`, `tien`, `giamgia`, `tongtien`, `trangthai`, `created_at`, `updated_at`) VALUES
(29, 'lu06SNkcq9Oi4Co3', 3, 3, 1000000, 0, 1000000, 1, '2023-04-16 13:28:25', '2023-04-16 13:28:25'),
(30, 'JFk1fSAc4iT77zx7', 7, 3, 100000, 0, 100000, 1, '2023-04-16 13:56:11', '2023-04-16 13:56:11'),
(31, 'EePPdhrXonnCvTJ7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-16 13:56:48', '2023-04-16 13:56:48'),
(32, 'ejQmxN2jfa5cjV17', 7, 3, 10000000, 0, 10000000, 1, '2023-04-16 13:59:48', '2023-04-16 13:59:48'),
(33, 'f7x0cNhPTyP684s7', 7, 3, 10000000, 0, 10000000, 1, '2023-04-16 14:01:48', '2023-04-16 14:01:48'),
(34, 'NF3G9ThJTjU2wQH7', 7, 3, 10000000, 0, 10000000, 1, '2023-04-16 14:03:21', '2023-04-16 14:03:21'),
(35, 'O1o0r5ougCS2iTA7', 7, 3, 100000, 0, 100000, 1, '2023-04-16 14:19:01', '2023-04-16 14:19:01'),
(36, 'SZRkeNsUyyeHyDB7', 7, 3, 10, 0, 10, 1, '2023-04-16 14:20:35', '2023-04-16 14:20:35'),
(37, '0BQTVlgMNkDOhVn7', 7, 3, 100000, 0, 100000, 1, '2023-04-16 14:21:09', '2023-04-16 14:21:09'),
(38, 'cSq7qN80dhkWsUg7', 7, 3, 100, 0, 100, 1, '2023-04-17 01:58:38', '2023-04-17 01:58:38'),
(39, 'EurhbyfSLq1V2qw7', 7, 3, 100000, 0, 100000, 1, '2023-04-17 01:58:45', '2023-04-17 01:58:45'),
(40, 'b10SVsvw2q0i1k37', 7, 3, 10000000, 0, 10000000, 2, '2023-04-17 03:02:40', '2023-04-17 16:18:56'),
(41, 'XnRMmHxTUzLfj6u7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-18 13:48:36', '2023-04-18 13:48:36'),
(42, 'reCZGA8n2M1OjYA7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-18 14:03:45', '2023-04-18 14:03:45'),
(43, 'Omnv2pjyMhijZOr7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-18 17:21:13', '2023-04-18 17:21:13'),
(44, 'OuOBCLBvUwxoaGb7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-18 17:30:28', '2023-04-18 17:30:28'),
(45, '0J6pghtygq1vwQG7', 7, 3, 1000000, 0, 1000000, 1, '2023-04-18 17:34:19', '2023-04-18 17:34:19'),
(46, 'oeIMR1ZBQeqTTOr7', 7, 3, 1000000, 0, 1000000, 2, '2023-04-18 17:36:26', '2023-04-18 17:46:09'),
(47, 'Pf3g3xv5NTepnun7', 7, 3, 1000000, 0, 1000000, 2, '2023-04-18 17:49:43', '2023-04-18 17:50:25'),
(48, '6F5EBvvY4AiiVfs7', 7, 3, 10000000, 0, 10000000, 2, '2023-04-26 07:24:25', '2023-04-26 07:25:25'),
(49, 'CWDC5SAwYhKl4RB7', 7, 3, 10000000, 0, 10000000, 2, '2023-05-31 17:19:24', '2023-06-01 14:43:53'),
(52, 'gHMUFBo7rkEM1iz7', 7, 3, 1000000, 0, 1000000, 2, '2023-06-01 14:43:16', '2023-06-01 14:43:29'),
(53, '8SUH36x1pWKrNKD7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:38:21', '2023-06-01 15:38:21'),
(54, 'vn5OoWzE0lMzBoF7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:53:43', '2023-06-01 15:53:43'),
(55, 'GSVzIAEu6dCOct67', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:53:56', '2023-06-01 15:53:56'),
(56, 'Ylwlt3pKPi2OGXT7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:55:27', '2023-06-01 15:55:27'),
(57, 'FYcySedBGrQmKbj7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:56:10', '2023-06-01 15:56:10'),
(58, 'Qf34HlI4djVINPU7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:56:51', '2023-06-01 15:56:51'),
(59, 'PWbSzZXGezstiyV7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:58:03', '2023-06-01 15:58:03'),
(60, 'TZ9Z8b0xgH4af5U7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 15:59:23', '2023-06-01 15:59:23'),
(61, 'RwewNlnE2Y7KMRw7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 16:00:24', '2023-06-01 16:00:24'),
(62, 'BWbhJhZhLcHQTvV7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 16:04:46', '2023-06-01 16:04:46'),
(63, 'p0z0sIopmJegRID7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-01 16:05:15', '2023-06-01 16:05:15'),
(64, 'MiZGc7kKJHK1ZOs7', 7, 3, 1000000, 0, 5000000, 2, '2023-06-01 16:06:46', '2023-06-01 16:09:21'),
(65, 'oSoqMvJG99jhkOa7', 7, 3, 1000000, 0, 1000000, 2, '2023-06-01 16:08:06', '2023-06-01 16:08:59'),
(80, 's4TGeGSX5pEfuNV16', 16, 3, 5000000, 0, 5000000, 2, '2023-06-05 09:17:36', '2023-06-05 09:18:03'),
(81, 'gK9Z2nkRWrVQzZq7', 7, 3, 500000, 0, 500000, 2, '2023-06-06 06:53:16', '2023-06-06 06:53:55'),
(82, 'IRDqcYykLjgXn947', 7, 3, 9000, 0, 9000, 1, '2023-06-07 02:51:49', '2023-06-07 02:51:49'),
(83, '3yY1DT9ZW8HNmVl7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-07 03:00:41', '2023-06-07 03:00:41'),
(84, 'QkXvIk4cNwuxczq7', 7, 3, 2000000, 0, 2000000, 2, '2023-06-09 08:50:39', '2023-06-09 08:51:10'),
(85, 'wYtWIBS6oVBMRaw7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-10 02:54:03', '2023-06-10 02:54:03'),
(86, 'lwzgLS2AYWqnmGr7', 7, 2, 500000, 0, 500000, 2, '2023-06-10 03:00:50', '2023-06-10 03:00:50'),
(87, 'X7TbYAwhlRaxI3B7', 7, 3, 100000, 0, 100000, 1, '2023-06-10 15:53:07', '2023-06-10 15:53:07'),
(88, 'wrI3MRprMbRY6Pp7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-10 16:04:52', '2023-06-10 16:04:52'),
(89, 'i5c24hNqZ3AyEmC7', 7, 2, 1000000, 40, 1000040, 2, '2023-06-10 16:06:20', '2023-06-10 16:06:20'),
(90, '3v7WU1QZSGOx1je7', 7, 3, 100000, 0, 100000, 2, '2023-06-10 16:23:44', '2023-06-10 16:24:02'),
(91, 'VJjwdE3vtgs6eRb7', 7, 3, 100000, 0, 100000, 2, '2023-06-10 16:24:23', '2023-06-10 16:24:40'),
(92, 'kQoxMNTxSi9sO5q7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-13 01:41:40', '2023-06-13 01:41:40'),
(93, 'MP23DAhCJRGfPAq7', 7, 3, 100000, 0, 100000, 1, '2023-06-13 01:42:02', '2023-06-13 01:42:02'),
(94, 'Tp2yyUwHqe98pk97', 7, 3, 100000, 0, 100000, 1, '2023-06-13 01:45:57', '2023-06-13 01:45:58'),
(95, 'CGFuTAZXJGj35fb7', 7, 3, 1000000, 0, 1000000, 1, '2023-06-17 09:13:33', '2023-06-17 09:13:33'),
(96, 'B8KU2Zro7FYNyXX7', 7, 3, 1000000, 0, 1000000, 2, '2023-06-17 09:42:26', '2023-06-17 09:42:59');

-- --------------------------------------------------------

--
-- Table structure for table `lichsu_thanhtoan`
--

CREATE TABLE `lichsu_thanhtoan` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `nguoidung_id` bigint(20) NOT NULL DEFAULT 0,
  `loai` tinyint(4) NOT NULL DEFAULT 1,
  `phong_id` int(11) NOT NULL DEFAULT 0,
  `dichvu_id` tinyint(4) NOT NULL DEFAULT 0,
  `tien` int(11) NOT NULL DEFAULT 0,
  `trangthai` tinyint(4) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `lichsu_thanhtoan`
--

INSERT INTO `lichsu_thanhtoan` (`id`, `nguoidung_id`, `loai`, `phong_id`, `dichvu_id`, `tien`, `trangthai`, `created_at`, `updated_at`) VALUES
(19, 7, 1, 19, 0, 40000, 2, '2023-04-17 16:38:39', '2023-04-17 16:38:39'),
(20, 7, 3, 19, 0, 600000, 2, '2023-04-17 16:39:32', '2023-04-17 16:39:32'),
(21, 7, 2, 20, 0, 100000, 2, '2023-04-17 16:42:10', '2023-04-17 16:42:10'),
(22, 7, 3, 20, 0, 600000, 2, '2023-04-17 16:48:54', '2023-04-17 16:48:55'),
(23, 7, 5, 18, 0, 1600000, 2, '2023-04-17 16:51:15', '2023-04-17 16:51:15'),
(24, 7, 5, 20, 0, 1600000, 2, '2023-04-18 17:51:08', '2023-04-18 17:51:08'),
(25, 7, 2, 20, 0, 400000, 2, '2023-04-24 01:48:35', '2023-04-24 01:48:35'),
(26, 7, 5, 24, 0, 1600000, 2, '2023-04-25 02:56:53', '2023-04-25 02:56:53'),
(27, 7, 2, 25, 0, 400000, 2, '2023-04-25 03:01:27', '2023-04-25 03:01:27'),
(28, 7, 5, 26, 0, 1600000, 2, '2023-04-25 15:30:28', '2023-04-25 15:30:28'),
(29, 7, 5, 32, 0, 1600000, 2, '2023-04-26 07:21:31', '2023-04-26 07:21:31'),
(30, 7, 3, 31, 0, 600000, 2, '2023-04-26 07:25:57', '2023-04-26 07:25:57'),
(31, 7, 2, 31, 0, 100000, 2, '2023-04-26 07:27:20', '2023-04-26 07:27:20'),
(32, 7, 2, 35, 0, 400000, 2, '2023-04-27 01:11:01', '2023-04-27 01:11:01'),
(33, 7, 5, 36, 0, 1600000, 2, '2023-04-27 01:15:49', '2023-04-27 01:15:49'),
(34, 7, 2, 31, 0, 400000, 2, '2023-04-27 01:37:34', '2023-04-27 01:37:34'),
(35, 7, 1, 38, 0, 40000, 2, '2023-04-27 01:43:56', '2023-04-27 01:43:56'),
(36, 7, 3, 39, 0, 600000, 2, '2023-04-29 15:19:20', '2023-04-29 15:19:21'),
(46, 7, 5, 49, 0, 1600000, 2, '2023-06-01 13:44:45', '2023-06-01 13:44:46'),
(47, 7, 4, 37, 0, 250000, 2, '2023-06-01 14:54:21', '2023-06-01 14:54:21'),
(48, 7, 2, 35, 0, 100000, 2, '2023-06-01 14:55:07', '2023-06-01 14:55:08'),
(49, 7, 2, 32, 0, 100000, 2, '2023-06-01 14:55:19', '2023-06-01 14:55:19'),
(50, 7, 1, 53, 0, 40000, 2, '2023-06-02 03:36:36', '2023-06-02 03:36:36'),
(51, 7, 5, 52, 0, 1600000, 2, '2023-06-02 03:37:25', '2023-06-02 03:37:25'),
(52, 7, 2, 51, 0, 280000, 2, '2023-06-02 03:37:35', '2023-06-02 03:37:35'),
(53, 7, 2, 50, 0, 240000, 2, '2023-06-02 03:37:45', '2023-06-02 03:37:45'),
(54, 7, 5, 50, 0, 1600000, 2, '2023-06-05 09:12:47', '2023-06-05 09:12:47'),
(55, 7, 2, 51, 0, 400000, 2, '2023-06-05 09:13:37', '2023-06-05 09:13:37'),
(56, 7, 3, 52, 0, 150000, 2, '2023-06-05 09:13:49', '2023-06-05 09:13:49'),
(57, 7, 5, 50, 0, 1600000, 2, '2023-06-05 09:19:47', '2023-06-05 09:19:48'),
(58, 7, 2, 52, 0, 400000, 2, '2023-06-05 10:47:53', '2023-06-05 10:47:53'),
(59, 7, 3, 54, 0, 600000, 2, '2023-06-05 10:49:07', '2023-06-05 10:49:07'),
(60, 7, 2, 56, 0, 100000, 2, '2023-06-07 02:55:30', '2023-06-07 02:55:30'),
(61, 7, 3, 58, 0, 600000, 2, '2023-06-08 18:13:34', '2023-06-08 18:13:34'),
(62, 7, 3, 65, 0, 600000, 2, '2023-06-09 02:40:38', '2023-06-09 02:40:38'),
(63, 7, 4, 65, 0, 950000, 2, '2023-06-09 09:13:17', '2023-06-09 09:13:17'),
(64, 7, 5, 80, 0, 1600000, 2, '2023-06-10 16:03:07', '2023-06-10 16:03:07'),
(65, 7, 5, 85, 0, 1600000, 2, '2023-06-11 01:02:21', '2023-06-11 01:02:21'),
(66, 7, 2, 88, 0, 400000, 2, '2023-06-11 01:03:28', '2023-06-11 01:03:28'),
(67, 7, 3, 86, 0, 600000, 2, '2023-06-11 01:03:54', '2023-06-11 01:03:54'),
(68, 7, 3, 86, 0, 600000, 2, '2023-06-11 01:03:54', '2023-06-11 01:03:54'),
(69, 7, 2, 91, 0, 400000, 2, '2023-06-11 06:53:18', '2023-06-11 06:53:18'),
(70, 7, 4, 91, 0, 250000, 2, '2023-06-11 09:46:41', '2023-06-11 09:46:41'),
(71, 7, 5, 93, 0, 1600000, 2, '2023-06-17 09:44:55', '2023-06-17 09:44:55');

-- --------------------------------------------------------

--
-- Table structure for table `ma_dien_thoai`
--

CREATE TABLE `ma_dien_thoai` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `maxacthuc` varchar(100) NOT NULL,
  `is_hoatdong` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `ma_dien_thoai`
--

INSERT INTO `ma_dien_thoai` (`id`, `maxacthuc`, `is_hoatdong`, `created_at`, `updated_at`) VALUES
(1, '638289', 0, '2023-06-10 17:43:17', '2023-06-10 17:43:17'),
(2, '570255', 0, '2023-06-10 17:51:00', '2023-06-10 17:51:00'),
(3, '117292', 0, '2023-06-10 17:56:41', '2023-06-10 17:56:41'),
(4, '814251', 0, '2023-06-10 17:57:49', '2023-06-10 17:57:49'),
(5, '111623', 0, '2023-06-10 17:59:00', '2023-06-10 17:59:00'),
(6, '425594', 0, '2023-06-10 18:00:09', '2023-06-10 18:00:09'),
(7, '261243', 0, '2023-06-10 18:00:47', '2023-06-10 18:00:47'),
(8, '994245', 0, '2023-06-10 18:04:35', '2023-06-10 18:04:35'),
(9, '461129', 0, '2023-06-10 18:04:46', '2023-06-10 18:04:46'),
(10, '113471', 0, '2023-06-10 18:04:58', '2023-06-10 18:04:58'),
(11, '760712', 0, '2023-06-10 18:05:51', '2023-06-10 18:05:51');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2022_06_12_162342_create_categories_table', 2),
(6, '2022_06_12_162532_create_locations_table', 3),
(8, '2022_06_12_163256_create_options_table', 4),
(9, '2022_06_12_163613_create_admins_table', 5),
(10, '2022_06_12_163809_create_images_table', 6),
(11, '2022_06_12_162740_create_rooms_table', 7),
(12, '2022_08_21_033748_create_codes_table', 8),
(13, '2022_10_26_072922_create_recharge_history_table', 9),
(14, '2022_10_26_072947_create_payment_history_table', 9),
(15, '2022_10_26_145748_create_menus_table', 10),
(16, '2022_10_26_145810_create_articles_table', 10),
(17, '2023_06_07_101247_create_test_id_table', 11),
(18, '2023_06_11_001623_create__ma_dien_thoai_table', 12),
(19, '2023_06_11_002506_create_ma_dien_thoai_table', 13);

-- --------------------------------------------------------

--
-- Table structure for table `nguoidung`
--

CREATE TABLE `nguoidung` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ten` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `sodienthoai` varchar(255) NOT NULL,
  `facebook` varchar(255) DEFAULT NULL,
  `anhdaidien` varchar(255) DEFAULT NULL,
  `sodukhadung` bigint(20) NOT NULL DEFAULT 0,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `nguoidung`
--

INSERT INTO `nguoidung` (`id`, `ten`, `email`, `sodienthoai`, `facebook`, `anhdaidien`, `sodukhadung`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(16, 'Nguyễn Văn A', 'ninh@gmail.com', '0942274668', NULL, NULL, 5000000, NULL, '$2y$10$9mAO4LQ468snBZb5ENUhp.4SXcOdJY00QEJdPPdpOGdip9XLqM2zu', NULL, '2023-06-05 09:16:01', '2023-06-05 09:18:03');

-- --------------------------------------------------------

--
-- Table structure for table `phong`
--

CREATE TABLE `phong` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ten` varchar(255) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `anhdaidien` varchar(255) DEFAULT NULL,
  `mota` text DEFAULT NULL,
  `qhuyen_id` bigint(20) NOT NULL DEFAULT 0,
  `phuongxa_id` bigint(20) NOT NULL DEFAULT 0,
  `gia` bigint(20) NOT NULL DEFAULT 0,
  `khoanggia` tinyint(4) NOT NULL DEFAULT 1,
  `khoangkhuvuc` tinyint(4) NOT NULL DEFAULT 1,
  `trangthai` tinyint(4) NOT NULL DEFAULT 1,
  `khuvuc` int(11) NOT NULL DEFAULT 0,
  `sophong` varchar(255) DEFAULT NULL,
  `chitietdiachi` varchar(255) DEFAULT NULL,
  `noidung` text DEFAULT NULL,
  `hot` tinyint(4) NOT NULL DEFAULT 0,
  `lydo` varchar(191) DEFAULT NULL,
  `danhmuc_id` bigint(20) UNSIGNED NOT NULL DEFAULT 0,
  `thoigian_batdau` date DEFAULT NULL,
  `thoigian_ketthuc` date DEFAULT NULL,
  `xacthuc_id` bigint(20) NOT NULL DEFAULT 0,
  `dichvu_hot` tinyint(4) NOT NULL DEFAULT 0,
  `map` text DEFAULT NULL,
  `subject_id` bigint(20) NOT NULL DEFAULT 0,
  `video_link` text DEFAULT NULL COMMENT 'link yt',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phong`
--

INSERT INTO `phong` (`id`, `ten`, `slug`, `anhdaidien`, `mota`, `qhuyen_id`, `phuongxa_id`, `gia`, `khoanggia`, `khoangkhuvuc`, `trangthai`, `khuvuc`, `sophong`, `chitietdiachi`, `noidung`, `hot`, `lydo`, `danhmuc_id`, `thoigian_batdau`, `thoigian_ketthuc`, `xacthuc_id`, `dichvu_hot`, `map`, `subject_id`, `video_link`, `created_at`, `updated_at`) VALUES
(85, 'Phòng trọ đường Hải Sơn quận Hải Châu Đà Nẵng', 'phong-tro-duong-hai-son-quan-hai-chau-da-nang', '2023-06-11__thiet-ke-phong-tro-dep-19.jpg', '<ol><li>Phòng trọ đường Hải Sơn quận Hải Châu Đà Nẵng</li><li>Gần trung tâm thành phố Đà Nẵng</li><li>Gần chợ Đống Đa và các gần các siêu thị và khu mua sắm</li><li>Thuận tiện cho việc đi lại làm việc và đi học</li><li>Gần các trường đại sư phạm Đà Nẵng, trường đại học Duy Tân, trường Ông Ích Khiêm..vv.</li></ol>', 44, 45, 1000000, 2, 1, 3, 15, '48', '48 Cao Thắng, Thanh Bình, Hải Châu', NULL, 0, NULL, 21, '2023-06-11', '2023-07-01', 7, 5, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3833.7650506977734!2d108.20948967500492!3d16.07767738460294!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x31421847b8d7ec71%3A0x7591c4b0240f6bc2!2zNDggQ2FvIFRo4bqvbmcsIFRoYW5oIELDrG5oLCBI4bqjaSBDaMOidSwgxJDDoCBO4bq1bmcgNTUwMDAwLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1686426498823!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-10 19:49:00', '2023-06-11 01:02:30'),
(86, 'Tìm bạn nữ ở ghép trong phòng trọ ở Hải Hồ - Thanh Bình - Hải Châu - Đà Nẵng', 'tim-ban-nu-o-ghep-trong-phong-tro-o-hai-ho-thanh-binh-hai-chau-da-nang', '2023-06-11__thiet-ke-phong-tro-dep-61.jpg', '<p>- 2tr7/2 ; Điện+Nước+ Wifi + Rác 100k/người</p><p>- Phòng rộng , sạch sẽ , an ninh tốt, có chỗ để xe rộng rãi , giờ giấc tự do, phòng vệ sinh riêng sạch sẽ, thoáng rộng, có ban công,</p><p>- Đã có đầy đủ nội thất rồi ạ , chỉ cần kéo vali vào ở thôi</p><p>- Địa chỉ ngay trung tâm thành phố, sau lưng nhà là chợ Đống Đa, chị chủ nhà cũng rất dễ thương.</p><p>- Bạn nào thiện chí muốn ở thì ib hoặc gọi điện cho mình để xem phòng nha</p><p>Địa chỉ : 96/27 Hải Hồ, Tp Đà Nẵng SĐT: 0942.567.036 ( Huyền) 0359826011 Hoàng</p>', 44, 45, 1400000, 2, 3, 3, 30, '41', '41 Hải Hồ, Phường Thanh Bình, Quận Hải Châu, Đà Nẵng', NULL, 0, NULL, 21, '2023-06-11', '2023-07-01', 7, 3, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m10!1m8!1m3!1d251637.95196238213!2d105.6189045!3d9.779349!3m2!1i1024!2i768!4f13.1!5e0!3m2!1svi!2s!4v1686442840259!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:21:16', '2023-06-11 01:04:28'),
(87, 'PHÒNG TRỌ/CĂN HỘ CHO THUÊ', 'phong-trocan-ho-cho-thue', '2023-06-11__thiet-ke-phong-tro-khep-kin-co-gac-lung-dep.jpg', '<p>- Diện tích mỗi phòng từ 15-25m2 (~20 phòng)</p><p>- Phòng có gác lửng riêng và nhà vệ sinh riêng biệt.</p><p>- Mỗi phòng đều có cửa sổ to rộng, thoáng mát (không bị che chắn bởi các nhà xung quanh)</p><p>- Có ban công phơi đồ riêng</p><p>- Nhà giữ xe có thể chứa được 50 xe máy.</p><p>- Yên tĩnh &amp; an ninh cao (có camera An Ninh 24/7)</p><p>- Giờ giấc tự do, riêng tư.</p><p>- Cách trường đại học Cao Đẳng Công Nghệ chỉ 2-3 phút đi xe máy.</p>', 44, 46, 1500000, 2, 2, 3, 20, '12', 'Đường Hải Hồ, Phường Thuận Phước, Quận Hải Châu, Đà Nẵng', NULL, 0, NULL, 21, NULL, NULL, 7, 0, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3833.710207526788!2d108.21298587500505!3d16.080520984600657!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x31421838c64248e9%3A0xcaa8a73199653726!2zSOG6o2kgSOG7kywgVGh14bqtbiBQaMaw4bubYywgSOG6o2kgQ2jDonUsIMSQw6AgTuG6tW5nIDU1MDAwMCwgVmnhu4d0IE5hbQ!5e0!3m2!1svi!2s!4v1686443044547!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:25:05', '2023-06-11 01:02:39'),
(88, 'Cần cho thuê phòng trọ tại 92 Đống Đa, Phường Thuận Phước, Quận Hải Châu, Đà Nẵng.', 'can-cho-thue-phong-tro-tai-92-dong-da-phuong-thuan-phuoc-quan-hai-chau-da-nang', '2023-06-11__thiet-ke-phong-tro-khep-kin-dep.jpg', '<p>Cần cho thuê phòng trọ</p><p>Phòng rộng rãi, sạch sẽ, thoáng mát, yên tĩnh</p><p>Địa chỉ: 92 Đống Đa, Phường Thuận Phước, Quận Hải Châu, Đà Nẵng</p><p>Khu trọ an ninh. Giao thông thuận tiện đi lại nhiều khu vực</p><p>Có đầy đủ các tiện ích dân sinh xung quanh</p><p>GIÁ : 1.500.000 - 2.000.000/THÁNG ( TUỲ THEO PHÒNG )</p>', 44, 46, 1500000, 2, 1, 3, 18, '92', '92 Đống Đa, Phường Thuận Phước, Quận Hải Châu, Đà Nẵng', NULL, 0, NULL, 21, '2023-06-11', '2023-07-01', 7, 2, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3833.6996181353697!2d108.21632507500495!3d16.081069984600173!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x314218394c9020dd%3A0xf246aadb48aecb0f!2zOTIgxJDhu5FuZyDEkGEsIFRodeG6rW4gUGjGsOG7m2MsIEjhuqNpIENow6J1LCDEkMOgIE7hurVuZyA1NTAwMDAsIFZp4buHdCBOYW0!5e0!3m2!1svi!2s!4v1686443282548!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:28:46', '2023-06-11 01:03:33'),
(89, 'Cho thuê nhà mặt tiền ngang 6m mới xây, đường Thanh Long', 'cho-thue-nha-mat-tien-ngang-6m-moi-xay-duong-thanh-long', '2023-06-11__thiet-ke-phong-tro-dep-20.jpg', '<p>Tôi cho thuê nhà mặt tiền mới xây, mặt tiền 6m đường Thanh Long, DT vỉa hè 18m². Ô tô có thể đậu trước nhà. Nhà 3 tầng, 2 PN, 2 WC, có ban công thoáng mát, hệ thống nước nóng gián tiếp đi các tầng, có thể rửa bát bằng nước nóng, nội thất mới, 1 điều hoà, 1 bình nước nóng gián tiếp, 1 tủ bếp, 1 tủ lạnh, 1 máy giặt lồng ngang, 1 máy lọc nước... Tiện nghi đầy đủ. Giá thuê: 10 tr/tháng.</p>', 44, 46, 10000000, 7, 7, 3, 97, NULL, 'Đường Thanh Long, Phường Thanh Bình, Quận Hải Châu, Đà Nẵng', NULL, 0, NULL, 22, NULL, NULL, 7, 0, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m16!1m12!1m3!1d15334.79849274073!2d108.20860024774159!3d16.081069722800056!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!2m1!1zxJDGsOG7nW5nIFRoYW5oIExvbmcsIFBoxrDhu51uZyBUaGFuaCBCw6xuaCwgUXXhuq1uIEjhuqNpIENow6J1LCDEkMOgIE7hurVuZw!5e0!3m2!1svi!2s!4v1686443534211!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:33:51', '2023-06-11 01:02:35'),
(90, 'Cho thuê tầng 1 ,dt 70m gần nhiều khách sạn lớn,gần biển', 'cho-thue-tang-1-dt-70m-gan-nhieu-khach-san-longan-bien', '2023-06-11__beauty-1621999245839-1622780852.jpg', '<p>Cho thuê tầng 1&nbsp;</p><p>Diện tích 70m2</p><p>Khu trung tâm du lịch gần nhiều ks lớn,cách biển 5 phút đi bộ,gần đường lớn Nguyễn văn thoại</p><p>Vui lòng liên hệ:&nbsp;0936441755 để biết thêm thông tin chi tiết</p>', 48, 50, 4500000, 4, 6, 3, 70, '50', 'Đường Nguyễn Văn Thoại, Phường An Hải Đông, Quận Sơn Trà, Đà Nẵng', NULL, 0, NULL, 21, NULL, NULL, 7, 0, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3834.2180034866537!2d108.23686137500435!3d16.054173184623163!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3142177da1064db7%3A0x536a71ea38335979!2zNTAgTmd1eeG7hW4gVsSDbiBUaG_huqFpLCBC4bqvYyBN4bu5IFBow7osIE5nxakgSMOgbmggU8ahbiwgxJDDoCBO4bq1bmcgNTUwMDAwLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1686444438687!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:47:48', '2023-06-11 02:36:18'),
(91, 'Cho thuê phòng trọ quận Sơn Trà, mới xây 100%, sát biển 200m', 'cho-thue-phong-tro-quan-son-tra-moi-xay-100-sat-bien-200m', '2023-06-11__thiet-ke-phong-tro-dep-31.jpg', '<p>- Địa chỉ: 18/3 Nguyễn Đức An, P. Mân thái, Sơn Trà.</p><p>- Diện tích sử dụng: 30-35m</p><p>- Nhà đổ mê 1 tầng (buổi tối lên sân thượng hóng gió biển :D)</p><p>- Phòng có gác lửng, rộng rãi, sạch sẽ, thiết bị mới 100%</p><p>- Miễn phí wifi, đồng hồ điện riêng, có sẵn hệ thống nóng lạnh và điều hoà</p><p>- Giờ giấc tự do, cho nuôi pet, có thể ở 3 người.</p><p>- Gần biển cách 200m, sau lưng khách sạn fusion Võ nguyễn Giáp. Có thể đi bộ ra biển vì rất gần.</p><p>Mọi người có nhu cầu liên hệ mình: 0905999057 (Mi)</p>', 48, 50, 2700000, 3, 3, 1, 30, NULL, '18/3 Đường Nguyễn Đức An, Phường Mân Thái, Quận Sơn Trà, Đà Nẵng', NULL, 0, NULL, 21, '2023-06-11', '2023-06-16', 7, 4, '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3833.6896360097194!2d108.24340197500494!3d16.08158748459967!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3142178c57e46cff%3A0x84030452686c1587!2zMTggxJAuIE5ndXnhu4VuIMSQ4bupYyBBbiwgTcOibiBUaMOhaSwgU8ahbiBUcsOgLCDEkMOgIE7hurVuZyA1NTAwMDAsIFZp4buHdCBOYW0!5e0!3m2!1svi!2s!4v1686445126214!5m2!1svi!2s\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>', 0, NULL, '2023-06-11 00:59:40', '2023-06-11 09:49:56'),
(93, 'Cho thuê phòng trọ tại thành phố đà nẵng', 'cho-thue-phong-tro-tai-thanh-pho-da-nang', NULL, '<ul><li>Tin đăng có hình ảnh rõ ràng sẽ được xem và gọi gấp nhiều lần so với tin rao không có ảnh. Hãy đăng ảnh để được giao dịch nhanh chóng!</li></ul>', 44, 45, 1000000, 2, 4, 3, 50, '48', '48 Thanh Bình', NULL, 0, NULL, 21, '2023-06-17', '2023-07-07', 7, 5, NULL, 0, NULL, '2023-06-17 09:44:37', '2023-06-17 09:45:19');

-- --------------------------------------------------------

--
-- Table structure for table `quantrivien`
--

CREATE TABLE `quantrivien` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(191) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `quantrivien`
--

INSERT INTO `quantrivien` (`id`, `email`, `password`, `created_at`, `updated_at`) VALUES
(1, 'admin@gmail.com', '$2a$12$Mqpx/mRTGcKfVJX12YENMeaHUWaSF2Z59cZhvrUqa6bvVTM8uxc7C', '2022-10-27 02:43:18', '2022-10-27 02:43:18');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `baiviet`
--
ALTER TABLE `baiviet`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `danhmuc`
--
ALTER TABLE `danhmuc`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `categories_slug_unique` (`slug`);

--
-- Indexes for table `diachi`
--
ALTER TABLE `diachi`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `locations_slug_unique` (`slug`);

--
-- Indexes for table `hinhanh_ct`
--
ALTER TABLE `hinhanh_ct`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lichsu_naptien`
--
ALTER TABLE `lichsu_naptien`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `recharge_history_code_unique` (`ma`);

--
-- Indexes for table `lichsu_thanhtoan`
--
ALTER TABLE `lichsu_thanhtoan`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ma_dien_thoai`
--
ALTER TABLE `ma_dien_thoai`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `ma_dien_thoai_maxacthuc_unique` (`maxacthuc`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `nguoidung`
--
ALTER TABLE `nguoidung`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`),
  ADD UNIQUE KEY `users_phone_unique` (`sodienthoai`);

--
-- Indexes for table `phong`
--
ALTER TABLE `phong`
  ADD PRIMARY KEY (`id`),
  ADD KEY `danhmuc_id` (`danhmuc_id`);

--
-- Indexes for table `quantrivien`
--
ALTER TABLE `quantrivien`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `admins_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `baiviet`
--
ALTER TABLE `baiviet`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `danhmuc`
--
ALTER TABLE `danhmuc`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `diachi`
--
ALTER TABLE `diachi`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;

--
-- AUTO_INCREMENT for table `hinhanh_ct`
--
ALTER TABLE `hinhanh_ct`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=137;

--
-- AUTO_INCREMENT for table `lichsu_naptien`
--
ALTER TABLE `lichsu_naptien`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=97;

--
-- AUTO_INCREMENT for table `lichsu_thanhtoan`
--
ALTER TABLE `lichsu_thanhtoan`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT for table `ma_dien_thoai`
--
ALTER TABLE `ma_dien_thoai`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `nguoidung`
--
ALTER TABLE `nguoidung`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `phong`
--
ALTER TABLE `phong`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=94;

--
-- AUTO_INCREMENT for table `quantrivien`
--
ALTER TABLE `quantrivien`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
