<?php


return [
    'price' => [
        1 => 'Dưới 1 triệu',
        2 => '1 đến 2 triệu',
        3 => '2 đến 3 triệu',
        4 => '3 đến 5 triệu',
        5 => '5 đến 7 triệu',
        6 => '7 đến 10 triệu',
        7 => '10 đến 15 triệu',
        8 => 'Trên 15 triệu',
    ],
    'khuvuc' => [
        1 => 'Dưới 20m2',
        2 => '20 đến 30m2',
        3 => '30 đến 50m2',
        4 => '50 đến 60m2',
        5 => '60 đến 70m2',
        6 => '70 đến 80m2',
        7 => '80 đến 100m2',
        8 => '100 đến 120m2',
        9 => '120 đến 150m2',
        10 => 'Trên 150m2',
    ]
];
